#printing
print("Hello World!")

#variables
var = 5       # و قيمته 5 var هنا قمنا بتعريف متغير إسمه
print(var)    # var هنا قمنا بطباعة قيمة المتغير

var = 10           # var هنا وضعنا رقم في المتغير
print(type(var))   # لأنها عبارة عن رقم int لاحظ أن نوعها سيكون .var هنا طبعنا نوع قيمة المتغير

var = 'moha'    # var هنا وضعنا نص في المتغير
print(type(var))   # لأنها عبارة عن نص str لاحظ أن نوعها سيكون .var هنا طبعنا نوع قيمة المتغير

var = 4J
print(type(var))

#list
A = []                                 # هنا قمنا بتعريف مصفوفة فارغة
B = [10, 20, 30, 40, 50]               # هنا قمنا بتعريف مصفوفة تحتوي على أعداد صحيحة فقط
C = ['Mhamad', 'Samer', 'Abdullah']    # هنا قمنا بتعريف مصفوفة تحتوي على نصوص فقط
D = [1, 'two', 'three', 4]             # هنا قمنا بتعريف مصفوفة تحتوي على أعداد صحيحة و نصوص

#operators
a = 5   # 5 و أعطيناه القيمة a هنا قمنا بتعريف متغير إسمه
b = a   # a و أعطيناه نفس قيمة المتغير b هنا قمنا بتعريف متغير إسمه

print('a =', a)
print('b =', b)

a = 3
b = 4

c = a + b   # c = 3 + 4 = 7

print('c =', c)

a = 3
b = 4

c = a - b   # c = 3 - 4 = -1

print('c =', c)

a = 6
b = 5

c = a * b     # c = 6 * 5 = 30

print('c =', c)

a = 2
b = 5

c = a ** b     # c = 2 ** 5 = 2 * 2 * 2 * 2 * 2 = 32

print('c =', c)

a = 8
b = 5

c = a / b     # c = 8 ÷ 5 = 1.6

print('c =', c)

a = 8
b = 5

c = a // b     # c = 8 ÷ 5 = 1.6    ===>     c = 1

print('c =', c)

a = 8
b = 5

c = a % b;     # c = 8 % 5 = 3

print('c =', c)